
my_list = ['Зима', 'Зима', 'Весна', 'Весна', 'Весна', 'Лето', 'Лето', 'Лето', 'Осень', 'Осень', 'Осень', 'Зима']
while True:
    try:
        while True:
            mounth_nuber = int(input('Введите номер месяца от 1 до 12: '))
            if 1 <= mounth_nuber <= 12:
                break
        break
    except ValueError:
        print('надо ввести число')

print(f'Сейчас {my_list[mounth_nuber - 1]}')

print('Второй метод:')

my_dict = {
    '1': 'Зима',
    '2': 'Зима',
    '3': 'Весна',
    '4': 'Весна',
    '5': 'Весна',
    '6': 'Лето',
    '7': 'Лето',
    '8': 'Лето',
    '9': 'Осень',
    '10': 'Осень',
    '11': 'Осень',
    '12': 'Зима'
}
print(f'Сейчас {my_dict[str(mounth_nuber)]}')